analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/emac_regs.h
/**
 * @file    emac_regs.h
 * @brief   Registers, Bit Masks and Bit Positions for the EMAC Peripheral Module.
 * @note    This file is @generated.
 * @ingroup emac_registers
 */

/******************************************************************************
 *
 * Copyright (C) 2022-2023 Maxim Integrated Products, Inc. All Rights Reserved.
 * (now owned by Analog Devices, Inc.),
 * Copyright (C) 2023 Analog Devices, Inc. All Rights Reserved. This software
 * is proprietary to Analog Devices, Inc. and its licensors.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_EMAC_REGS_H_
#define LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_EMAC_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined (__ICCARM__)
  #pragma system_include
#endif

#if defined (__CC_ARM)
  #pragma anon_unions
#endif
/// @cond
/*
    If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/* **** Definitions **** */

/**
 * @ingroup     emac
 * @defgroup    emac_registers EMAC_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the EMAC Peripheral Module.
 * @details     10/100 Ethernet MAC.
 */

/**
 * @ingroup emac_registers
 * Structure type to access the EMAC Registers.
 */
typedef struct {
    __IO uint32_t cn;                   /**< <tt>\b 0x00:</tt> EMAC CN Register */
    __IO uint32_t cfg;                  /**< <tt>\b 0x04:</tt> EMAC CFG Register */
    __I  uint32_t status;               /**< <tt>\b 0x08:</tt> EMAC STATUS Register */
    __R  uint32_t rsv_0xc_0x13[2];
    __IO uint32_t tx_st;                /**< <tt>\b 0x14:</tt> EMAC TX_ST Register */
    __IO uint32_t rxbuf_ptr;            /**< <tt>\b 0x18:</tt> EMAC RXBUF_PTR Register */
    __IO uint32_t txbuf_ptr;            /**< <tt>\b 0x1C:</tt> EMAC TXBUF_PTR Register */
    __IO uint32_t rx_st;                /**< <tt>\b 0x20:</tt> EMAC RX_ST Register */
    __IO uint32_t int_st;               /**< <tt>\b 0x24:</tt> EMAC INT_ST Register */
    __O  uint32_t int_en;               /**< <tt>\b 0x28:</tt> EMAC INT_EN Register */
    __O  uint32_t int_dis;              /**< <tt>\b 0x2C:</tt> EMAC INT_DIS Register */
    __I  uint32_t int_mask;             /**< <tt>\b 0x30:</tt> EMAC INT_MASK Register */
    __IO uint32_t phy_mt;               /**< <tt>\b 0x34:</tt> EMAC PHY_MT Register */
    __I  uint32_t pt;                   /**< <tt>\b 0x38:</tt> EMAC PT Register */
    __IO uint32_t pfr;                  /**< <tt>\b 0x3C:</tt> EMAC PFR Register */
    __IO uint32_t ftok;                 /**< <tt>\b 0x40:</tt> EMAC FTOK Register */
    __IO uint32_t scf;                  /**< <tt>\b 0x44:</tt> EMAC SCF Register */
    __IO uint32_t mcf;                  /**< <tt>\b 0x48:</tt> EMAC MCF Register */
    __IO uint32_t frok;                 /**< <tt>\b 0x4C:</tt> EMAC FROK Register */
    __IO uint32_t fcs_err;              /**< <tt>\b 0x50:</tt> EMAC FCS_ERR Register */
    __IO uint32_t algn_err;             /**< <tt>\b 0x54:</tt> EMAC ALGN_ERR Register */
    __IO uint32_t dftxf;                /**< <tt>\b 0x58:</tt> EMAC DFTXF Register */
    __IO uint32_t lc;                   /**< <tt>\b 0x5C:</tt> EMAC LC Register */
    __IO uint32_t ec;                   /**< <tt>\b 0x60:</tt> EMAC EC Register */
    __IO uint32_t tur_err;              /**< <tt>\b 0x64:</tt> EMAC TUR_ERR Register */
    __IO uint32_t cs_err;               /**< <tt>\b 0x68:</tt> EMAC CS_ERR Register */
    __IO uint32_t rr_err;               /**< <tt>\b 0x6C:</tt> EMAC RR_ERR Register */
    __IO uint32_t ror_err;              /**< <tt>\b 0x70:</tt> EMAC ROR_ERR Register */
    __IO uint32_t rs_err;               /**< <tt>\b 0x74:</tt> EMAC RS_ERR Register */
    __IO uint32_t el_err;               /**< <tt>\b 0x78:</tt> EMAC EL_ERR Register */
    __IO uint32_t rj;                   /**< <tt>\b 0x7C:</tt> EMAC RJ Register */
    __IO uint32_t usf;                  /**< <tt>\b 0x80:</tt> EMAC USF Register */
    __IO uint32_t sqe_err;              /**< <tt>\b 0x84:</tt> EMAC SQE_ERR Register */
    __IO uint32_t rlfm;                 /**< <tt>\b 0x88:</tt> EMAC RLFM Register */
    __IO uint32_t tpf;                  /**< <tt>\b 0x8C:</tt> EMAC TPF Register */
    __IO uint32_t hashl;                /**< <tt>\b 0x90:</tt> EMAC HASHL Register */
    __IO uint32_t hashh;                /**< <tt>\b 0x94:</tt> EMAC HASHH Register */
    __IO uint32_t sa1l;                 /**< <tt>\b 0x98:</tt> EMAC SA1L Register */
    __IO uint32_t sa1h;                 /**< <tt>\b 0x9C:</tt> EMAC SA1H Register */
    __IO uint32_t sa2l;                 /**< <tt>\b 0xA0:</tt> EMAC SA2L Register */
    __IO uint32_t sa2h;                 /**< <tt>\b 0xA4:</tt> EMAC SA2H Register */
    __IO uint32_t sa3l;                 /**< <tt>\b 0xA8:</tt> EMAC SA3L Register */
    __IO uint32_t sa3h;                 /**< <tt>\b 0xAC:</tt> EMAC SA3H Register */
    __IO uint32_t sa4l;                 /**< <tt>\b 0xB0:</tt> EMAC SA4L Register */
    __IO uint32_t sa4h;                 /**< <tt>\b 0xB4:</tt> EMAC SA4H Register */
    __IO uint32_t tid_ck;               /**< <tt>\b 0xB8:</tt> EMAC TID_CK Register */
    __IO uint32_t tpq;                  /**< <tt>\b 0xBC:</tt> EMAC TPQ Register */
    __IO uint32_t io_ctrl;              /**< <tt>\b 0xC0:</tt> EMAC IO_CTRL Register */
    __R  uint32_t rsv_0xc4_0xfb[14];
    __I  uint32_t rev;                  /**< <tt>\b 0xFC:</tt> EMAC REV Register */
} mxc_emac_regs_t;

/* Register offsets for module EMAC */
/**
 * @ingroup    emac_registers
 * @defgroup   EMAC_Register_Offsets Register Offsets
 * @brief      EMAC Peripheral Register Offsets from the EMAC Base Peripheral Address.
 * @{
 */
#define MXC_R_EMAC_CN                      ((uint32_t)0x00000000UL) /**< Offset from EMAC Base Address: <tt> 0x0000</tt> */
#define MXC_R_EMAC_CFG                     ((uint32_t)0x00000004UL) /**< Offset from EMAC Base Address: <tt> 0x0004</tt> */
#define MXC_R_EMAC_STATUS                  ((uint32_t)0x00000008UL) /**< Offset from EMAC Base Address: <tt> 0x0008</tt> */
#define MXC_R_EMAC_TX_ST                   ((uint32_t)0x00000014UL) /**< Offset from EMAC Base Address: <tt> 0x0014</tt> */
#define MXC_R_EMAC_RXBUF_PTR               ((uint32_t)0x00000018UL) /**< Offset from EMAC Base Address: <tt> 0x0018</tt> */
#define MXC_R_EMAC_TXBUF_PTR               ((uint32_t)0x0000001CUL) /**< Offset from EMAC Base Address: <tt> 0x001C</tt> */
#define MXC_R_EMAC_RX_ST                   ((uint32_t)0x00000020UL) /**< Offset from EMAC Base Address: <tt> 0x0020</tt> */
#define MXC_R_EMAC_INT_ST                  ((uint32_t)0x00000024UL) /**< Offset from EMAC Base Address: <tt> 0x0024</tt> */
#define MXC_R_EMAC_INT_EN                  ((uint32_t)0x00000028UL) /**< Offset from EMAC Base Address: <tt> 0x0028</tt> */
#define MXC_R_EMAC_INT_DIS                 ((uint32_t)0x0000002CUL) /**< Offset from EMAC Base Address: <tt> 0x002C</tt> */
#define MXC_R_EMAC_INT_MASK                ((uint32_t)0x00000030UL) /**< Offset from EMAC Base Address: <tt> 0x0030</tt> */
#define MXC_R_EMAC_PHY_MT                  ((uint32_t)0x00000034UL) /**< Offset from EMAC Base Address: <tt> 0x0034</tt> */
#define MXC_R_EMAC_PT                      ((uint32_t)0x00000038UL) /**< Offset from EMAC Base Address: <tt> 0x0038</tt> */
#define MXC_R_EMAC_PFR                     ((uint32_t)0x0000003CUL) /**< Offset from EMAC Base Address: <tt> 0x003C</tt> */
#define MXC_R_EMAC_FTOK                    ((uint32_t)0x00000040UL) /**< Offset from EMAC Base Address: <tt> 0x0040</tt> */
#define MXC_R_EMAC_SCF                     ((uint32_t)0x00000044UL) /**< Offset from EMAC Base Address: <tt> 0x0044</tt> */
#define MXC_R_EMAC_MCF                     ((uint32_t)0x00000048UL) /**< Offset from EMAC Base Address: <tt> 0x0048</tt> */
#define MXC_R_EMAC_FROK                    ((uint32_t)0x0000004CUL) /**< Offset from EMAC Base Address: <tt> 0x004C</tt> */
#define MXC_R_EMAC_FCS_ERR                 ((uint32_t)0x00000050UL) /**< Offset from EMAC Base Address: <tt> 0x0050</tt> */
#define MXC_R_EMAC_ALGN_ERR                ((uint32_t)0x00000054UL) /**< Offset from EMAC Base Address: <tt> 0x0054</tt> */
#define MXC_R_EMAC_DFTXF                   ((uint32_t)0x00000058UL) /**< Offset from EMAC Base Address: <tt> 0x0058</tt> */
#define MXC_R_EMAC_LC                      ((uint32_t)0x0000005CUL) /**< Offset from EMAC Base Address: <tt> 0x005C</tt> */
#define MXC_R_EMAC_EC                      ((uint32_t)0x00000060UL) /**< Offset from EMAC Base Address: <tt> 0x0060</tt> */
#define MXC_R_EMAC_TUR_ERR                 ((uint32_t)0x00000064UL) /**< Offset from EMAC Base Address: <tt> 0x0064</tt> */
#define MXC_R_EMAC_CS_ERR                  ((uint32_t)0x00000068UL) /**< Offset from EMAC Base Address: <tt> 0x0068</tt> */
#define MXC_R_EMAC_RR_ERR                  ((uint32_t)0x0000006CUL) /**< Offset from EMAC Base Address: <tt> 0x006C</tt> */
#define MXC_R_EMAC_ROR_ERR                 ((uint32_t)0x00000070UL) /**< Offset from EMAC Base Address: <tt> 0x0070</tt> */
#define MXC_R_EMAC_RS_ERR                  ((uint32_t)0x00000074UL) /**< Offset from EMAC Base Address: <tt> 0x0074</tt> */
#define MXC_R_EMAC_EL_ERR                  ((uint32_t)0x00000078UL) /**< Offset from EMAC Base Address: <tt> 0x0078</tt> */
#define MXC_R_EMAC_RJ                      ((uint32_t)0x0000007CUL) /**< Offset from EMAC Base Address: <tt> 0x007C</tt> */
#define MXC_R_EMAC_USF                     ((uint32_t)0x00000080UL) /**< Offset from EMAC Base Address: <tt> 0x0080</tt> */
#define MXC_R_EMAC_SQE_ERR                 ((uint32_t)0x00000084UL) /**< Offset from EMAC Base Address: <tt> 0x0084</tt> */
#define MXC_R_EMAC_RLFM                    ((uint32_t)0x00000088UL) /**< Offset from EMAC Base Address: <tt> 0x0088</tt> */
#define MXC_R_EMAC_TPF                     ((uint32_t)0x0000008CUL) /**< Offset from EMAC Base Address: <tt> 0x008C</tt> */
#define MXC_R_EMAC_HASHL                   ((uint32_t)0x00000090UL) /**< Offset from EMAC Base Address: <tt> 0x0090</tt> */
#define MXC_R_EMAC_HASHH                   ((uint32_t)0x00000094UL) /**< Offset from EMAC Base Address: <tt> 0x0094</tt> */
#define MXC_R_EMAC_SA1L                    ((uint32_t)0x00000098UL) /**< Offset from EMAC Base Address: <tt> 0x0098</tt> */
#define MXC_R_EMAC_SA1H                    ((uint32_t)0x0000009CUL) /**< Offset from EMAC Base Address: <tt> 0x009C</tt> */
#define MXC_R_EMAC_SA2L                    ((uint32_t)0x000000A0UL) /**< Offset from EMAC Base Address: <tt> 0x00A0</tt> */
#define MXC_R_EMAC_SA2H                    ((uint32_t)0x000000A4UL) /**< Offset from EMAC Base Address: <tt> 0x00A4</tt> */
#define MXC_R_EMAC_SA3L                    ((uint32_t)0x000000A8UL) /**< Offset from EMAC Base Address: <tt> 0x00A8</tt> */
#define MXC_R_EMAC_SA3H                    ((uint32_t)0x000000ACUL) /**< Offset from EMAC Base Address: <tt> 0x00AC</tt> */
#define MXC_R_EMAC_SA4L                    ((uint32_t)0x000000B0UL) /**< Offset from EMAC Base Address: <tt> 0x00B0</tt> */
#define MXC_R_EMAC_SA4H                    ((uint32_t)0x000000B4UL) /**< Offset from EMAC Base Address: <tt> 0x00B4</tt> */
#define MXC_R_EMAC_TID_CK                  ((uint32_t)0x000000B8UL) /**< Offset from EMAC Base Address: <tt> 0x00B8</tt> */
#define MXC_R_EMAC_TPQ                     ((uint32_t)0x000000BCUL) /**< Offset from EMAC Base Address: <tt> 0x00BC</tt> */
#define MXC_R_EMAC_IO_CTRL                 ((uint32_t)0x000000C0UL) /**< Offset from EMAC Base Address: <tt> 0x00C0</tt> */
#define MXC_R_EMAC_REV                     ((uint32_t)0x000000FCUL) /**< Offset from EMAC Base Address: <tt> 0x00FC</tt> */
/**@} end of group emac_registers */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_CN EMAC_CN
 * @brief    Network Control Register.
 * @{
 */
#define MXC_F_EMAC_CN_LB_POS                           0 /**< CN_LB Position */
#define MXC_F_EMAC_CN_LB                               ((uint32_t)(0x1UL << MXC_F_EMAC_CN_LB_POS)) /**< CN_LB Mask */

#define MXC_F_EMAC_CN_LBL_POS                          1 /**< CN_LBL Position */
#define MXC_F_EMAC_CN_LBL                              ((uint32_t)(0x1UL << MXC_F_EMAC_CN_LBL_POS)) /**< CN_LBL Mask */

#define MXC_F_EMAC_CN_RXEN_POS                         2 /**< CN_RXEN Position */
#define MXC_F_EMAC_CN_RXEN                             ((uint32_t)(0x1UL << MXC_F_EMAC_CN_RXEN_POS)) /**< CN_RXEN Mask */

#define MXC_F_EMAC_CN_TXEN_POS                         3 /**< CN_TXEN Position */
#define MXC_F_EMAC_CN_TXEN                             ((uint32_t)(0x1UL << MXC_F_EMAC_CN_TXEN_POS)) /**< CN_TXEN Mask */

#define MXC_F_EMAC_CN_MPEN_POS                         4 /**< CN_MPEN Position */
#define MXC_F_EMAC_CN_MPEN                             ((uint32_t)(0x1UL << MXC_F_EMAC_CN_MPEN_POS)) /**< CN_MPEN Mask */

