analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/emac_regs.h
#define MXC_F_EMAC_CN_CLST_POS                         5 /**< CN_CLST Position */
#define MXC_F_EMAC_CN_CLST                             ((uint32_t)(0x1UL << MXC_F_EMAC_CN_CLST_POS)) /**< CN_CLST Mask */

#define MXC_F_EMAC_CN_INCST_POS                        6 /**< CN_INCST Position */
#define MXC_F_EMAC_CN_INCST                            ((uint32_t)(0x1UL << MXC_F_EMAC_CN_INCST_POS)) /**< CN_INCST Mask */

#define MXC_F_EMAC_CN_WREN_POS                         7 /**< CN_WREN Position */
#define MXC_F_EMAC_CN_WREN                             ((uint32_t)(0x1UL << MXC_F_EMAC_CN_WREN_POS)) /**< CN_WREN Mask */

#define MXC_F_EMAC_CN_BP_POS                           8 /**< CN_BP Position */
#define MXC_F_EMAC_CN_BP                               ((uint32_t)(0x1UL << MXC_F_EMAC_CN_BP_POS)) /**< CN_BP Mask */

#define MXC_F_EMAC_CN_TXSTART_POS                      9 /**< CN_TXSTART Position */
#define MXC_F_EMAC_CN_TXSTART                          ((uint32_t)(0x1UL << MXC_F_EMAC_CN_TXSTART_POS)) /**< CN_TXSTART Mask */

#define MXC_F_EMAC_CN_TXHALT_POS                       10 /**< CN_TXHALT Position */
#define MXC_F_EMAC_CN_TXHALT                           ((uint32_t)(0x1UL << MXC_F_EMAC_CN_TXHALT_POS)) /**< CN_TXHALT Mask */

#define MXC_F_EMAC_CN_TXPF_POS                         11 /**< CN_TXPF Position */
#define MXC_F_EMAC_CN_TXPF                             ((uint32_t)(0x1UL << MXC_F_EMAC_CN_TXPF_POS)) /**< CN_TXPF Mask */

#define MXC_F_EMAC_CN_TXZQPF_POS                       12 /**< CN_TXZQPF Position */
#define MXC_F_EMAC_CN_TXZQPF                           ((uint32_t)(0x1UL << MXC_F_EMAC_CN_TXZQPF_POS)) /**< CN_TXZQPF Mask */

/**@} end of group EMAC_CN_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_CFG EMAC_CFG
 * @brief    Network Configuration Register.
 * @{
 */
#define MXC_F_EMAC_CFG_SPEED_POS                       0 /**< CFG_SPEED Position */
#define MXC_F_EMAC_CFG_SPEED                           ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_SPEED_POS)) /**< CFG_SPEED Mask */

#define MXC_F_EMAC_CFG_FULLDPLX_POS                    1 /**< CFG_FULLDPLX Position */
#define MXC_F_EMAC_CFG_FULLDPLX                        ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_FULLDPLX_POS)) /**< CFG_FULLDPLX Mask */

#define MXC_F_EMAC_CFG_BITRATE_POS                     2 /**< CFG_BITRATE Position */
#define MXC_F_EMAC_CFG_BITRATE                         ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_BITRATE_POS)) /**< CFG_BITRATE Mask */

#define MXC_F_EMAC_CFG_JUMBOFR_POS                     3 /**< CFG_JUMBOFR Position */
#define MXC_F_EMAC_CFG_JUMBOFR                         ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_JUMBOFR_POS)) /**< CFG_JUMBOFR Mask */

#define MXC_F_EMAC_CFG_COPYAF_POS                      4 /**< CFG_COPYAF Position */
#define MXC_F_EMAC_CFG_COPYAF                          ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_COPYAF_POS)) /**< CFG_COPYAF Mask */

#define MXC_F_EMAC_CFG_NOBC_POS                        5 /**< CFG_NOBC Position */
#define MXC_F_EMAC_CFG_NOBC                            ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_NOBC_POS)) /**< CFG_NOBC Mask */

#define MXC_F_EMAC_CFG_MHEN_POS                        6 /**< CFG_MHEN Position */
#define MXC_F_EMAC_CFG_MHEN                            ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_MHEN_POS)) /**< CFG_MHEN Mask */

#define MXC_F_EMAC_CFG_UHEN_POS                        7 /**< CFG_UHEN Position */
#define MXC_F_EMAC_CFG_UHEN                            ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_UHEN_POS)) /**< CFG_UHEN Mask */

#define MXC_F_EMAC_CFG_RXFR_POS                        8 /**< CFG_RXFR Position */
#define MXC_F_EMAC_CFG_RXFR                            ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_RXFR_POS)) /**< CFG_RXFR Mask */

#define MXC_F_EMAC_CFG_MDCCLK_POS                      10 /**< CFG_MDCCLK Position */
#define MXC_F_EMAC_CFG_MDCCLK                          ((uint32_t)(0x3UL << MXC_F_EMAC_CFG_MDCCLK_POS)) /**< CFG_MDCCLK Mask */
#define MXC_V_EMAC_CFG_MDCCLK_DIV8                     ((uint32_t)0x0UL) /**< CFG_MDCCLK_DIV8 Value */
#define MXC_S_EMAC_CFG_MDCCLK_DIV8                     (MXC_V_EMAC_CFG_MDCCLK_DIV8 << MXC_F_EMAC_CFG_MDCCLK_POS) /**< CFG_MDCCLK_DIV8 Setting */
#define MXC_V_EMAC_CFG_MDCCLK_DIV16                    ((uint32_t)0x1UL) /**< CFG_MDCCLK_DIV16 Value */
#define MXC_S_EMAC_CFG_MDCCLK_DIV16                    (MXC_V_EMAC_CFG_MDCCLK_DIV16 << MXC_F_EMAC_CFG_MDCCLK_POS) /**< CFG_MDCCLK_DIV16 Setting */
#define MXC_V_EMAC_CFG_MDCCLK_DIV32                    ((uint32_t)0x2UL) /**< CFG_MDCCLK_DIV32 Value */
#define MXC_S_EMAC_CFG_MDCCLK_DIV32                    (MXC_V_EMAC_CFG_MDCCLK_DIV32 << MXC_F_EMAC_CFG_MDCCLK_POS) /**< CFG_MDCCLK_DIV32 Setting */
#define MXC_V_EMAC_CFG_MDCCLK_DIV64                    ((uint32_t)0x3UL) /**< CFG_MDCCLK_DIV64 Value */
#define MXC_S_EMAC_CFG_MDCCLK_DIV64                    (MXC_V_EMAC_CFG_MDCCLK_DIV64 << MXC_F_EMAC_CFG_MDCCLK_POS) /**< CFG_MDCCLK_DIV64 Setting */

#define MXC_F_EMAC_CFG_RTTST_POS                       12 /**< CFG_RTTST Position */
#define MXC_F_EMAC_CFG_RTTST                           ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_RTTST_POS)) /**< CFG_RTTST Mask */

#define MXC_F_EMAC_CFG_PAUSEEN_POS                     13 /**< CFG_PAUSEEN Position */
#define MXC_F_EMAC_CFG_PAUSEEN                         ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_PAUSEEN_POS)) /**< CFG_PAUSEEN Mask */

#define MXC_F_EMAC_CFG_RXBUFFOFS_POS                   14 /**< CFG_RXBUFFOFS Position */
#define MXC_F_EMAC_CFG_RXBUFFOFS                       ((uint32_t)(0x3UL << MXC_F_EMAC_CFG_RXBUFFOFS_POS)) /**< CFG_RXBUFFOFS Mask */

#define MXC_F_EMAC_CFG_RXLFCEN_POS                     16 /**< CFG_RXLFCEN Position */
#define MXC_F_EMAC_CFG_RXLFCEN                         ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_RXLFCEN_POS)) /**< CFG_RXLFCEN Mask */

#define MXC_F_EMAC_CFG_DCRXFCS_POS                     17 /**< CFG_DCRXFCS Position */
#define MXC_F_EMAC_CFG_DCRXFCS                         ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_DCRXFCS_POS)) /**< CFG_DCRXFCS Mask */

#define MXC_F_EMAC_CFG_HDPLXRXEN_POS                   18 /**< CFG_HDPLXRXEN Position */
#define MXC_F_EMAC_CFG_HDPLXRXEN                       ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_HDPLXRXEN_POS)) /**< CFG_HDPLXRXEN Mask */

#define MXC_F_EMAC_CFG_IGNRXFCS_POS                    19 /**< CFG_IGNRXFCS Position */
#define MXC_F_EMAC_CFG_IGNRXFCS                        ((uint32_t)(0x1UL << MXC_F_EMAC_CFG_IGNRXFCS_POS)) /**< CFG_IGNRXFCS Mask */

