analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/emac_regs.h
/**@} end of group EMAC_CFG_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_STATUS EMAC_STATUS
 * @brief    Network Status Register.
 * @{
 */
#define MXC_F_EMAC_STATUS_LINK_POS                     0 /**< STATUS_LINK Position */
#define MXC_F_EMAC_STATUS_LINK                         ((uint32_t)(0x1UL << MXC_F_EMAC_STATUS_LINK_POS)) /**< STATUS_LINK Mask */

#define MXC_F_EMAC_STATUS_MDIO_POS                     1 /**< STATUS_MDIO Position */
#define MXC_F_EMAC_STATUS_MDIO                         ((uint32_t)(0x1UL << MXC_F_EMAC_STATUS_MDIO_POS)) /**< STATUS_MDIO Mask */

#define MXC_F_EMAC_STATUS_IDLE_POS                     2 /**< STATUS_IDLE Position */
#define MXC_F_EMAC_STATUS_IDLE                         ((uint32_t)(0x1UL << MXC_F_EMAC_STATUS_IDLE_POS)) /**< STATUS_IDLE Mask */

/**@} end of group EMAC_STATUS_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_TX_ST EMAC_TX_ST
 * @brief    Transmit Status Register.
 * @{
 */
#define MXC_F_EMAC_TX_ST_UBR_POS                       0 /**< TX_ST_UBR Position */
#define MXC_F_EMAC_TX_ST_UBR                           ((uint32_t)(0x1UL << MXC_F_EMAC_TX_ST_UBR_POS)) /**< TX_ST_UBR Mask */

#define MXC_F_EMAC_TX_ST_COLS_POS                      1 /**< TX_ST_COLS Position */
#define MXC_F_EMAC_TX_ST_COLS                          ((uint32_t)(0x1UL << MXC_F_EMAC_TX_ST_COLS_POS)) /**< TX_ST_COLS Mask */

#define MXC_F_EMAC_TX_ST_RTYLIM_POS                    2 /**< TX_ST_RTYLIM Position */
#define MXC_F_EMAC_TX_ST_RTYLIM                        ((uint32_t)(0x1UL << MXC_F_EMAC_TX_ST_RTYLIM_POS)) /**< TX_ST_RTYLIM Mask */

#define MXC_F_EMAC_TX_ST_TXGO_POS                      3 /**< TX_ST_TXGO Position */
#define MXC_F_EMAC_TX_ST_TXGO                          ((uint32_t)(0x1UL << MXC_F_EMAC_TX_ST_TXGO_POS)) /**< TX_ST_TXGO Mask */

#define MXC_F_EMAC_TX_ST_BEMF_POS                      4 /**< TX_ST_BEMF Position */
#define MXC_F_EMAC_TX_ST_BEMF                          ((uint32_t)(0x1UL << MXC_F_EMAC_TX_ST_BEMF_POS)) /**< TX_ST_BEMF Mask */

#define MXC_F_EMAC_TX_ST_TXCMPL_POS                    5 /**< TX_ST_TXCMPL Position */
#define MXC_F_EMAC_TX_ST_TXCMPL                        ((uint32_t)(0x1UL << MXC_F_EMAC_TX_ST_TXCMPL_POS)) /**< TX_ST_TXCMPL Mask */

#define MXC_F_EMAC_TX_ST_TXUR_POS                      6 /**< TX_ST_TXUR Position */
#define MXC_F_EMAC_TX_ST_TXUR                          ((uint32_t)(0x1UL << MXC_F_EMAC_TX_ST_TXUR_POS)) /**< TX_ST_TXUR Mask */

/**@} end of group EMAC_TX_ST_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_RXBUF_PTR EMAC_RXBUF_PTR
 * @brief    Receive Buffer Queue Pointer Register.
 * @{
 */
#define MXC_F_EMAC_RXBUF_PTR_RXBUF_POS                 2 /**< RXBUF_PTR_RXBUF Position */
#define MXC_F_EMAC_RXBUF_PTR_RXBUF                     ((uint32_t)(0x3FFFFFFFUL << MXC_F_EMAC_RXBUF_PTR_RXBUF_POS)) /**< RXBUF_PTR_RXBUF Mask */

/**@} end of group EMAC_RXBUF_PTR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_TXBUF_PTR EMAC_TXBUF_PTR
 * @brief    Transmit Buffer Queue Pointer Register.
 * @{
 */
#define MXC_F_EMAC_TXBUF_PTR_TXBUF_POS                 2 /**< TXBUF_PTR_TXBUF Position */
#define MXC_F_EMAC_TXBUF_PTR_TXBUF                     ((uint32_t)(0x3FFFFFFFUL << MXC_F_EMAC_TXBUF_PTR_TXBUF_POS)) /**< TXBUF_PTR_TXBUF Mask */

/**@} end of group EMAC_TXBUF_PTR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_RX_ST EMAC_RX_ST
 * @brief    Receive Status Register.
 * @{
 */
#define MXC_F_EMAC_RX_ST_BNA_POS                       0 /**< RX_ST_BNA Position */
#define MXC_F_EMAC_RX_ST_BNA                           ((uint32_t)(0x1UL << MXC_F_EMAC_RX_ST_BNA_POS)) /**< RX_ST_BNA Mask */

#define MXC_F_EMAC_RX_ST_FR_POS                        1 /**< RX_ST_FR Position */
#define MXC_F_EMAC_RX_ST_FR                            ((uint32_t)(0x1UL << MXC_F_EMAC_RX_ST_FR_POS)) /**< RX_ST_FR Mask */

#define MXC_F_EMAC_RX_ST_RXOR_POS                      2 /**< RX_ST_RXOR Position */
#define MXC_F_EMAC_RX_ST_RXOR                          ((uint32_t)(0x1UL << MXC_F_EMAC_RX_ST_RXOR_POS)) /**< RX_ST_RXOR Mask */

/**@} end of group EMAC_RX_ST_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_INT_ST EMAC_INT_ST
 * @brief    Interrupt Status Register.
 * @{
 */
#define MXC_F_EMAC_INT_ST_MPS_POS                      0 /**< INT_ST_MPS Position */
#define MXC_F_EMAC_INT_ST_MPS                          ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_MPS_POS)) /**< INT_ST_MPS Mask */

#define MXC_F_EMAC_INT_ST_RXCMPL_POS                   1 /**< INT_ST_RXCMPL Position */
#define MXC_F_EMAC_INT_ST_RXCMPL                       ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_RXCMPL_POS)) /**< INT_ST_RXCMPL Mask */

#define MXC_F_EMAC_INT_ST_RXUBR_POS                    2 /**< INT_ST_RXUBR Position */
#define MXC_F_EMAC_INT_ST_RXUBR                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_RXUBR_POS)) /**< INT_ST_RXUBR Mask */

#define MXC_F_EMAC_INT_ST_TXUBR_POS                    3 /**< INT_ST_TXUBR Position */
#define MXC_F_EMAC_INT_ST_TXUBR                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_TXUBR_POS)) /**< INT_ST_TXUBR Mask */

#define MXC_F_EMAC_INT_ST_TXUR_POS                     4 /**< INT_ST_TXUR Position */
#define MXC_F_EMAC_INT_ST_TXUR                         ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_TXUR_POS)) /**< INT_ST_TXUR Mask */

#define MXC_F_EMAC_INT_ST_RLE_POS                      5 /**< INT_ST_RLE Position */
#define MXC_F_EMAC_INT_ST_RLE                          ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_RLE_POS)) /**< INT_ST_RLE Mask */

#define MXC_F_EMAC_INT_ST_TXERR_POS                    6 /**< INT_ST_TXERR Position */
#define MXC_F_EMAC_INT_ST_TXERR                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_TXERR_POS)) /**< INT_ST_TXERR Mask */

#define MXC_F_EMAC_INT_ST_TXCMPL_POS                   7 /**< INT_ST_TXCMPL Position */
#define MXC_F_EMAC_INT_ST_TXCMPL                       ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_TXCMPL_POS)) /**< INT_ST_TXCMPL Mask */

#define MXC_F_EMAC_INT_ST_LC_POS                       9 /**< INT_ST_LC Position */
#define MXC_F_EMAC_INT_ST_LC                           ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_LC_POS)) /**< INT_ST_LC Mask */

