analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/emac_regs.h
#define MXC_F_EMAC_INT_ST_RXOR_POS                     10 /**< INT_ST_RXOR Position */
#define MXC_F_EMAC_INT_ST_RXOR                         ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_RXOR_POS)) /**< INT_ST_RXOR Mask */

#define MXC_F_EMAC_INT_ST_HRESPNO_POS                  11 /**< INT_ST_HRESPNO Position */
#define MXC_F_EMAC_INT_ST_HRESPNO                      ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_HRESPNO_POS)) /**< INT_ST_HRESPNO Mask */

#define MXC_F_EMAC_INT_ST_PPR_POS                      12 /**< INT_ST_PPR Position */
#define MXC_F_EMAC_INT_ST_PPR                          ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_PPR_POS)) /**< INT_ST_PPR Mask */

#define MXC_F_EMAC_INT_ST_PTZ_POS                      13 /**< INT_ST_PTZ Position */
#define MXC_F_EMAC_INT_ST_PTZ                          ((uint32_t)(0x1UL << MXC_F_EMAC_INT_ST_PTZ_POS)) /**< INT_ST_PTZ Mask */

/**@} end of group EMAC_INT_ST_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_INT_EN EMAC_INT_EN
 * @brief    Interrupt Enable Register.
 * @{
 */
#define MXC_F_EMAC_INT_EN_MPS_POS                      0 /**< INT_EN_MPS Position */
#define MXC_F_EMAC_INT_EN_MPS                          ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_MPS_POS)) /**< INT_EN_MPS Mask */

#define MXC_F_EMAC_INT_EN_RXCMPL_POS                   1 /**< INT_EN_RXCMPL Position */
#define MXC_F_EMAC_INT_EN_RXCMPL                       ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_RXCMPL_POS)) /**< INT_EN_RXCMPL Mask */

#define MXC_F_EMAC_INT_EN_RXUBR_POS                    2 /**< INT_EN_RXUBR Position */
#define MXC_F_EMAC_INT_EN_RXUBR                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_RXUBR_POS)) /**< INT_EN_RXUBR Mask */

#define MXC_F_EMAC_INT_EN_TXUBR_POS                    3 /**< INT_EN_TXUBR Position */
#define MXC_F_EMAC_INT_EN_TXUBR                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_TXUBR_POS)) /**< INT_EN_TXUBR Mask */

#define MXC_F_EMAC_INT_EN_TXUR_POS                     4 /**< INT_EN_TXUR Position */
#define MXC_F_EMAC_INT_EN_TXUR                         ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_TXUR_POS)) /**< INT_EN_TXUR Mask */

#define MXC_F_EMAC_INT_EN_RLE_POS                      5 /**< INT_EN_RLE Position */
#define MXC_F_EMAC_INT_EN_RLE                          ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_RLE_POS)) /**< INT_EN_RLE Mask */

#define MXC_F_EMAC_INT_EN_TXERR_POS                    6 /**< INT_EN_TXERR Position */
#define MXC_F_EMAC_INT_EN_TXERR                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_TXERR_POS)) /**< INT_EN_TXERR Mask */

#define MXC_F_EMAC_INT_EN_TXCMPL_POS                   7 /**< INT_EN_TXCMPL Position */
#define MXC_F_EMAC_INT_EN_TXCMPL                       ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_TXCMPL_POS)) /**< INT_EN_TXCMPL Mask */

#define MXC_F_EMAC_INT_EN_LC_POS                       9 /**< INT_EN_LC Position */
#define MXC_F_EMAC_INT_EN_LC                           ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_LC_POS)) /**< INT_EN_LC Mask */

#define MXC_F_EMAC_INT_EN_RXOR_POS                     10 /**< INT_EN_RXOR Position */
#define MXC_F_EMAC_INT_EN_RXOR                         ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_RXOR_POS)) /**< INT_EN_RXOR Mask */

#define MXC_F_EMAC_INT_EN_HRESPNO_POS                  11 /**< INT_EN_HRESPNO Position */
#define MXC_F_EMAC_INT_EN_HRESPNO                      ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_HRESPNO_POS)) /**< INT_EN_HRESPNO Mask */

#define MXC_F_EMAC_INT_EN_PPR_POS                      12 /**< INT_EN_PPR Position */
#define MXC_F_EMAC_INT_EN_PPR                          ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_PPR_POS)) /**< INT_EN_PPR Mask */

#define MXC_F_EMAC_INT_EN_PTZ_POS                      13 /**< INT_EN_PTZ Position */
#define MXC_F_EMAC_INT_EN_PTZ                          ((uint32_t)(0x1UL << MXC_F_EMAC_INT_EN_PTZ_POS)) /**< INT_EN_PTZ Mask */

/**@} end of group EMAC_INT_EN_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_INT_DIS EMAC_INT_DIS
 * @brief    Interrupt Disable Register.
 * @{
 */
#define MXC_F_EMAC_INT_DIS_MPS_POS                     0 /**< INT_DIS_MPS Position */
#define MXC_F_EMAC_INT_DIS_MPS                         ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_MPS_POS)) /**< INT_DIS_MPS Mask */

#define MXC_F_EMAC_INT_DIS_RXCMPL_POS                  1 /**< INT_DIS_RXCMPL Position */
#define MXC_F_EMAC_INT_DIS_RXCMPL                      ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_RXCMPL_POS)) /**< INT_DIS_RXCMPL Mask */

#define MXC_F_EMAC_INT_DIS_RXUBR_POS                   2 /**< INT_DIS_RXUBR Position */
#define MXC_F_EMAC_INT_DIS_RXUBR                       ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_RXUBR_POS)) /**< INT_DIS_RXUBR Mask */

#define MXC_F_EMAC_INT_DIS_TXUBR_POS                   3 /**< INT_DIS_TXUBR Position */
#define MXC_F_EMAC_INT_DIS_TXUBR                       ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_TXUBR_POS)) /**< INT_DIS_TXUBR Mask */

#define MXC_F_EMAC_INT_DIS_TXUR_POS                    4 /**< INT_DIS_TXUR Position */
#define MXC_F_EMAC_INT_DIS_TXUR                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_TXUR_POS)) /**< INT_DIS_TXUR Mask */

#define MXC_F_EMAC_INT_DIS_RLE_POS                     5 /**< INT_DIS_RLE Position */
#define MXC_F_EMAC_INT_DIS_RLE                         ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_RLE_POS)) /**< INT_DIS_RLE Mask */

#define MXC_F_EMAC_INT_DIS_TXERR_POS                   6 /**< INT_DIS_TXERR Position */
#define MXC_F_EMAC_INT_DIS_TXERR                       ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_TXERR_POS)) /**< INT_DIS_TXERR Mask */

#define MXC_F_EMAC_INT_DIS_TXCMPL_POS                  7 /**< INT_DIS_TXCMPL Position */
#define MXC_F_EMAC_INT_DIS_TXCMPL                      ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_TXCMPL_POS)) /**< INT_DIS_TXCMPL Mask */

#define MXC_F_EMAC_INT_DIS_LC_POS                      9 /**< INT_DIS_LC Position */
#define MXC_F_EMAC_INT_DIS_LC                          ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_LC_POS)) /**< INT_DIS_LC Mask */

