analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/emac_regs.h
#define MXC_F_EMAC_INT_DIS_RXOR_POS                    10 /**< INT_DIS_RXOR Position */
#define MXC_F_EMAC_INT_DIS_RXOR                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_RXOR_POS)) /**< INT_DIS_RXOR Mask */

#define MXC_F_EMAC_INT_DIS_HRESPNO_POS                 11 /**< INT_DIS_HRESPNO Position */
#define MXC_F_EMAC_INT_DIS_HRESPNO                     ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_HRESPNO_POS)) /**< INT_DIS_HRESPNO Mask */

#define MXC_F_EMAC_INT_DIS_PPR_POS                     12 /**< INT_DIS_PPR Position */
#define MXC_F_EMAC_INT_DIS_PPR                         ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_PPR_POS)) /**< INT_DIS_PPR Mask */

#define MXC_F_EMAC_INT_DIS_PTZ_POS                     13 /**< INT_DIS_PTZ Position */
#define MXC_F_EMAC_INT_DIS_PTZ                         ((uint32_t)(0x1UL << MXC_F_EMAC_INT_DIS_PTZ_POS)) /**< INT_DIS_PTZ Mask */

/**@} end of group EMAC_INT_DIS_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_INT_MASK EMAC_INT_MASK
 * @brief    Interrupt Mask Register.
 * @{
 */
#define MXC_F_EMAC_INT_MASK_MPS_POS                    0 /**< INT_MASK_MPS Position */
#define MXC_F_EMAC_INT_MASK_MPS                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_MPS_POS)) /**< INT_MASK_MPS Mask */

#define MXC_F_EMAC_INT_MASK_RXCMPL_POS                 1 /**< INT_MASK_RXCMPL Position */
#define MXC_F_EMAC_INT_MASK_RXCMPL                     ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_RXCMPL_POS)) /**< INT_MASK_RXCMPL Mask */

#define MXC_F_EMAC_INT_MASK_RXUBR_POS                  2 /**< INT_MASK_RXUBR Position */
#define MXC_F_EMAC_INT_MASK_RXUBR                      ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_RXUBR_POS)) /**< INT_MASK_RXUBR Mask */

#define MXC_F_EMAC_INT_MASK_TXUBR_POS                  3 /**< INT_MASK_TXUBR Position */
#define MXC_F_EMAC_INT_MASK_TXUBR                      ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_TXUBR_POS)) /**< INT_MASK_TXUBR Mask */

#define MXC_F_EMAC_INT_MASK_TXUR_POS                   4 /**< INT_MASK_TXUR Position */
#define MXC_F_EMAC_INT_MASK_TXUR                       ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_TXUR_POS)) /**< INT_MASK_TXUR Mask */

#define MXC_F_EMAC_INT_MASK_RLE_POS                    5 /**< INT_MASK_RLE Position */
#define MXC_F_EMAC_INT_MASK_RLE                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_RLE_POS)) /**< INT_MASK_RLE Mask */

#define MXC_F_EMAC_INT_MASK_TXERR_POS                  6 /**< INT_MASK_TXERR Position */
#define MXC_F_EMAC_INT_MASK_TXERR                      ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_TXERR_POS)) /**< INT_MASK_TXERR Mask */

#define MXC_F_EMAC_INT_MASK_TXCMPL_POS                 7 /**< INT_MASK_TXCMPL Position */
#define MXC_F_EMAC_INT_MASK_TXCMPL                     ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_TXCMPL_POS)) /**< INT_MASK_TXCMPL Mask */

#define MXC_F_EMAC_INT_MASK_LC_POS                     9 /**< INT_MASK_LC Position */
#define MXC_F_EMAC_INT_MASK_LC                         ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_LC_POS)) /**< INT_MASK_LC Mask */

#define MXC_F_EMAC_INT_MASK_RXOR_POS                   10 /**< INT_MASK_RXOR Position */
#define MXC_F_EMAC_INT_MASK_RXOR                       ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_RXOR_POS)) /**< INT_MASK_RXOR Mask */

#define MXC_F_EMAC_INT_MASK_HRESPNO_POS                11 /**< INT_MASK_HRESPNO Position */
#define MXC_F_EMAC_INT_MASK_HRESPNO                    ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_HRESPNO_POS)) /**< INT_MASK_HRESPNO Mask */

#define MXC_F_EMAC_INT_MASK_PPR_POS                    12 /**< INT_MASK_PPR Position */
#define MXC_F_EMAC_INT_MASK_PPR                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_PPR_POS)) /**< INT_MASK_PPR Mask */

#define MXC_F_EMAC_INT_MASK_PTZ_POS                    13 /**< INT_MASK_PTZ Position */
#define MXC_F_EMAC_INT_MASK_PTZ                        ((uint32_t)(0x1UL << MXC_F_EMAC_INT_MASK_PTZ_POS)) /**< INT_MASK_PTZ Mask */

/**@} end of group EMAC_INT_MASK_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_PHY_MT EMAC_PHY_MT
 * @brief    PHY Maintenance Register.
 * @{
 */
#define MXC_F_EMAC_PHY_MT_DATA_POS                     0 /**< PHY_MT_DATA Position */
#define MXC_F_EMAC_PHY_MT_DATA                         ((uint32_t)(0xFFFFUL << MXC_F_EMAC_PHY_MT_DATA_POS)) /**< PHY_MT_DATA Mask */

#define MXC_F_EMAC_PHY_MT_REGADDR_POS                  18 /**< PHY_MT_REGADDR Position */
#define MXC_F_EMAC_PHY_MT_REGADDR                      ((uint32_t)(0x1FUL << MXC_F_EMAC_PHY_MT_REGADDR_POS)) /**< PHY_MT_REGADDR Mask */

#define MXC_F_EMAC_PHY_MT_PHYADDR_POS                  23 /**< PHY_MT_PHYADDR Position */
#define MXC_F_EMAC_PHY_MT_PHYADDR                      ((uint32_t)(0x1FUL << MXC_F_EMAC_PHY_MT_PHYADDR_POS)) /**< PHY_MT_PHYADDR Mask */

#define MXC_F_EMAC_PHY_MT_OP_POS                       28 /**< PHY_MT_OP Position */
#define MXC_F_EMAC_PHY_MT_OP                           ((uint32_t)(0x3UL << MXC_F_EMAC_PHY_MT_OP_POS)) /**< PHY_MT_OP Mask */
#define MXC_V_EMAC_PHY_MT_OP_WRITE                     ((uint32_t)0x1UL) /**< PHY_MT_OP_WRITE Value */
#define MXC_S_EMAC_PHY_MT_OP_WRITE                     (MXC_V_EMAC_PHY_MT_OP_WRITE << MXC_F_EMAC_PHY_MT_OP_POS) /**< PHY_MT_OP_WRITE Setting */
#define MXC_V_EMAC_PHY_MT_OP_READ                      ((uint32_t)0x2UL) /**< PHY_MT_OP_READ Value */
#define MXC_S_EMAC_PHY_MT_OP_READ                      (MXC_V_EMAC_PHY_MT_OP_READ << MXC_F_EMAC_PHY_MT_OP_POS) /**< PHY_MT_OP_READ Setting */

#define MXC_F_EMAC_PHY_MT_SOP_POS                      30 /**< PHY_MT_SOP Position */
#define MXC_F_EMAC_PHY_MT_SOP                          ((uint32_t)(0x3UL << MXC_F_EMAC_PHY_MT_SOP_POS)) /**< PHY_MT_SOP Mask */

/**@} end of group EMAC_PHY_MT_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_PT EMAC_PT
 * @brief    Pause Time Register.
 * @{
 */
#define MXC_F_EMAC_PT_TIME_POS                         0 /**< PT_TIME Position */
#define MXC_F_EMAC_PT_TIME                             ((uint32_t)(0xFFFFUL << MXC_F_EMAC_PT_TIME_POS)) /**< PT_TIME Mask */

/**@} end of group EMAC_PT_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_PFR EMAC_PFR
 * @brief    Pause Frame Received OK.
 * @{
 */
#define MXC_F_EMAC_PFR_PFR_POS                         0 /**< PFR_PFR Position */
#define MXC_F_EMAC_PFR_PFR                             ((uint32_t)(0xFFFFUL << MXC_F_EMAC_PFR_PFR_POS)) /**< PFR_PFR Mask */

/**@} end of group EMAC_PFR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_FTOK EMAC_FTOK
 * @brief    Frames Transmitted OK.
 * @{
 */
#define MXC_F_EMAC_FTOK_FTOK_POS                       0 /**< FTOK_FTOK Position */
#define MXC_F_EMAC_FTOK_FTOK                           ((uint32_t)(0xFFFFFFFFUL << MXC_F_EMAC_FTOK_FTOK_POS)) /**< FTOK_FTOK Mask */

