analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/emac_regs.h
/**@} end of group EMAC_FTOK_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_SCF EMAC_SCF
 * @brief    Single Collision Frames.
 * @{
 */
#define MXC_F_EMAC_SCF_SCF_POS                         0 /**< SCF_SCF Position */
#define MXC_F_EMAC_SCF_SCF                             ((uint32_t)(0xFFFFUL << MXC_F_EMAC_SCF_SCF_POS)) /**< SCF_SCF Mask */

/**@} end of group EMAC_SCF_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_MCF EMAC_MCF
 * @brief    Multiple Collision Frames.
 * @{
 */
#define MXC_F_EMAC_MCF_MCF_POS                         0 /**< MCF_MCF Position */
#define MXC_F_EMAC_MCF_MCF                             ((uint32_t)(0xFFFFUL << MXC_F_EMAC_MCF_MCF_POS)) /**< MCF_MCF Mask */

/**@} end of group EMAC_MCF_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_FROK EMAC_FROK
 * @brief    Fames Received OK.
 * @{
 */
#define MXC_F_EMAC_FROK_FROK_POS                       0 /**< FROK_FROK Position */
#define MXC_F_EMAC_FROK_FROK                           ((uint32_t)(0xFFFFFFUL << MXC_F_EMAC_FROK_FROK_POS)) /**< FROK_FROK Mask */

/**@} end of group EMAC_FROK_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_FCS_ERR EMAC_FCS_ERR
 * @brief    Frame Check Sequence Errors.
 * @{
 */
#define MXC_F_EMAC_FCS_ERR_FCSERR_POS                  0 /**< FCS_ERR_FCSERR Position */
#define MXC_F_EMAC_FCS_ERR_FCSERR                      ((uint32_t)(0xFFUL << MXC_F_EMAC_FCS_ERR_FCSERR_POS)) /**< FCS_ERR_FCSERR Mask */

/**@} end of group EMAC_FCS_ERR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_ALGN_ERR EMAC_ALGN_ERR
 * @brief    Alignment Errors.
 * @{
 */
#define MXC_F_EMAC_ALGN_ERR_ALGNERR_POS                0 /**< ALGN_ERR_ALGNERR Position */
#define MXC_F_EMAC_ALGN_ERR_ALGNERR                    ((uint32_t)(0xFFUL << MXC_F_EMAC_ALGN_ERR_ALGNERR_POS)) /**< ALGN_ERR_ALGNERR Mask */

/**@} end of group EMAC_ALGN_ERR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_DFTXF EMAC_DFTXF
 * @brief    Deferred Transmission Frames.
 * @{
 */
#define MXC_F_EMAC_DFTXF_DFTXF_POS                     0 /**< DFTXF_DFTXF Position */
#define MXC_F_EMAC_DFTXF_DFTXF                         ((uint32_t)(0xFFFFUL << MXC_F_EMAC_DFTXF_DFTXF_POS)) /**< DFTXF_DFTXF Mask */

/**@} end of group EMAC_DFTXF_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_LC EMAC_LC
 * @brief    Late Collisions.
 * @{
 */
#define MXC_F_EMAC_LC_LC_POS                           0 /**< LC_LC Position */
#define MXC_F_EMAC_LC_LC                               ((uint32_t)(0xFFUL << MXC_F_EMAC_LC_LC_POS)) /**< LC_LC Mask */

/**@} end of group EMAC_LC_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_EC EMAC_EC
 * @brief    Excessive Collisions.
 * @{
 */
#define MXC_F_EMAC_EC_EC_POS                           0 /**< EC_EC Position */
#define MXC_F_EMAC_EC_EC                               ((uint32_t)(0xFFUL << MXC_F_EMAC_EC_EC_POS)) /**< EC_EC Mask */

/**@} end of group EMAC_EC_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_TUR_ERR EMAC_TUR_ERR
 * @brief    Transmit Underrun Errors.
 * @{
 */
#define MXC_F_EMAC_TUR_ERR_TURERR_POS                  0 /**< TUR_ERR_TURERR Position */
#define MXC_F_EMAC_TUR_ERR_TURERR                      ((uint32_t)(0xFFUL << MXC_F_EMAC_TUR_ERR_TURERR_POS)) /**< TUR_ERR_TURERR Mask */

/**@} end of group EMAC_TUR_ERR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_CS_ERR EMAC_CS_ERR
 * @brief    Carrier Sense Errors.
 * @{
 */
#define MXC_F_EMAC_CS_ERR_CSERR_POS                    0 /**< CS_ERR_CSERR Position */
#define MXC_F_EMAC_CS_ERR_CSERR                        ((uint32_t)(0xFFUL << MXC_F_EMAC_CS_ERR_CSERR_POS)) /**< CS_ERR_CSERR Mask */

/**@} end of group EMAC_CS_ERR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_RR_ERR EMAC_RR_ERR
 * @brief    Receive Resource Errors.
 * @{
 */
#define MXC_F_EMAC_RR_ERR_RRERR_POS                    0 /**< RR_ERR_RRERR Position */
#define MXC_F_EMAC_RR_ERR_RRERR                        ((uint32_t)(0xFFFFUL << MXC_F_EMAC_RR_ERR_RRERR_POS)) /**< RR_ERR_RRERR Mask */

/**@} end of group EMAC_RR_ERR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_ROR_ERR EMAC_ROR_ERR
 * @brief    Receive Overrun Errors.
 * @{
 */
#define MXC_F_EMAC_ROR_ERR_RORERR_POS                  0 /**< ROR_ERR_RORERR Position */
#define MXC_F_EMAC_ROR_ERR_RORERR                      ((uint32_t)(0xFFUL << MXC_F_EMAC_ROR_ERR_RORERR_POS)) /**< ROR_ERR_RORERR Mask */

/**@} end of group EMAC_ROR_ERR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_RS_ERR EMAC_RS_ERR
 * @brief    Receive Symbol Errors.
 * @{
 */
#define MXC_F_EMAC_RS_ERR_RSERR_POS                    0 /**< RS_ERR_RSERR Position */
#define MXC_F_EMAC_RS_ERR_RSERR                        ((uint32_t)(0xFFUL << MXC_F_EMAC_RS_ERR_RSERR_POS)) /**< RS_ERR_RSERR Mask */

/**@} end of group EMAC_RS_ERR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_EL_ERR EMAC_EL_ERR
 * @brief    Excessive Length Errors.
 * @{
 */
#define MXC_F_EMAC_EL_ERR_ELERR_POS                    0 /**< EL_ERR_ELERR Position */
#define MXC_F_EMAC_EL_ERR_ELERR                        ((uint32_t)(0xFFUL << MXC_F_EMAC_EL_ERR_ELERR_POS)) /**< EL_ERR_ELERR Mask */

/**@} end of group EMAC_EL_ERR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_RJ EMAC_RJ
 * @brief    Receive Jabber.
 * @{
 */
#define MXC_F_EMAC_RJ_RJERR_POS                        0 /**< RJ_RJERR Position */
#define MXC_F_EMAC_RJ_RJERR                            ((uint32_t)(0xFFUL << MXC_F_EMAC_RJ_RJERR_POS)) /**< RJ_RJERR Mask */

/**@} end of group EMAC_RJ_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_USF EMAC_USF
 * @brief    Undersize Frames.
 * @{
 */
#define MXC_F_EMAC_USF_USF_POS                         0 /**< USF_USF Position */
#define MXC_F_EMAC_USF_USF                             ((uint32_t)(0xFFUL << MXC_F_EMAC_USF_USF_POS)) /**< USF_USF Mask */

/**@} end of group EMAC_USF_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_SQE_ERR EMAC_SQE_ERR
 * @brief    SQE Test Errors.
 * @{
 */
#define MXC_F_EMAC_SQE_ERR_SQEERR_POS                  0 /**< SQE_ERR_SQEERR Position */
#define MXC_F_EMAC_SQE_ERR_SQEERR                      ((uint32_t)(0xFFUL << MXC_F_EMAC_SQE_ERR_SQEERR_POS)) /**< SQE_ERR_SQEERR Mask */

/**@} end of group EMAC_SQE_ERR_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_RLFM EMAC_RLFM
 * @brief    Received Length Field Mismatch.
 * @{
 */
#define MXC_F_EMAC_RLFM_RLFM_POS                       0 /**< RLFM_RLFM Position */
#define MXC_F_EMAC_RLFM_RLFM                           ((uint32_t)(0xFFUL << MXC_F_EMAC_RLFM_RLFM_POS)) /**< RLFM_RLFM Mask */

