analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32570/Include/emac_regs.h
/**@} end of group EMAC_RLFM_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_TPF EMAC_TPF
 * @brief    Transmitted Pause Frames.
 * @{
 */
#define MXC_F_EMAC_TPF_TPF_POS                         0 /**< TPF_TPF Position */
#define MXC_F_EMAC_TPF_TPF                             ((uint32_t)(0xFFFFUL << MXC_F_EMAC_TPF_TPF_POS)) /**< TPF_TPF Mask */

/**@} end of group EMAC_TPF_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_HASHL EMAC_HASHL
 * @brief    Hash Register Bottom [31:0].
 * @{
 */
#define MXC_F_EMAC_HASHL_HASH_POS                      0 /**< HASHL_HASH Position */
#define MXC_F_EMAC_HASHL_HASH                          ((uint32_t)(0xFFFFFFFFUL << MXC_F_EMAC_HASHL_HASH_POS)) /**< HASHL_HASH Mask */

/**@} end of group EMAC_HASHL_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_HASHH EMAC_HASHH
 * @brief    Hash Register top [63:32].
 * @{
 */
#define MXC_F_EMAC_HASHH_HASH_POS                      0 /**< HASHH_HASH Position */
#define MXC_F_EMAC_HASHH_HASH                          ((uint32_t)(0xFFFFFFFFUL << MXC_F_EMAC_HASHH_HASH_POS)) /**< HASHH_HASH Mask */

/**@} end of group EMAC_HASHH_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_SA1L EMAC_SA1L
 * @brief    Specific Address 1 Bottom.
 * @{
 */
#define MXC_F_EMAC_SA1L_ADDR_POS                       0 /**< SA1L_ADDR Position */
#define MXC_F_EMAC_SA1L_ADDR                           ((uint32_t)(0xFFFFFFFFUL << MXC_F_EMAC_SA1L_ADDR_POS)) /**< SA1L_ADDR Mask */

/**@} end of group EMAC_SA1L_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_SA1H EMAC_SA1H
 * @brief    Specific Address 1 Top.
 * @{
 */
#define MXC_F_EMAC_SA1H_ADDR_POS                       0 /**< SA1H_ADDR Position */
#define MXC_F_EMAC_SA1H_ADDR                           ((uint32_t)(0xFFFFUL << MXC_F_EMAC_SA1H_ADDR_POS)) /**< SA1H_ADDR Mask */

/**@} end of group EMAC_SA1H_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_SA2L EMAC_SA2L
 * @brief    Specific Address 2 Bottom.
 * @{
 */
#define MXC_F_EMAC_SA2L_ADDR_POS                       0 /**< SA2L_ADDR Position */
#define MXC_F_EMAC_SA2L_ADDR                           ((uint32_t)(0xFFFFFFFFUL << MXC_F_EMAC_SA2L_ADDR_POS)) /**< SA2L_ADDR Mask */

/**@} end of group EMAC_SA2L_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_SA2H EMAC_SA2H
 * @brief    Specific Address 2 Top.
 * @{
 */
#define MXC_F_EMAC_SA2H_ADDR_POS                       0 /**< SA2H_ADDR Position */
#define MXC_F_EMAC_SA2H_ADDR                           ((uint32_t)(0xFFFFUL << MXC_F_EMAC_SA2H_ADDR_POS)) /**< SA2H_ADDR Mask */

/**@} end of group EMAC_SA2H_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_SA3L EMAC_SA3L
 * @brief    Specific Address 3 Bottom.
 * @{
 */
#define MXC_F_EMAC_SA3L_ADDR_POS                       0 /**< SA3L_ADDR Position */
#define MXC_F_EMAC_SA3L_ADDR                           ((uint32_t)(0xFFFFFFFFUL << MXC_F_EMAC_SA3L_ADDR_POS)) /**< SA3L_ADDR Mask */

/**@} end of group EMAC_SA3L_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_SA3H EMAC_SA3H
 * @brief    Specific Address 3 Top.
 * @{
 */
#define MXC_F_EMAC_SA3H_ADDR_POS                       0 /**< SA3H_ADDR Position */
#define MXC_F_EMAC_SA3H_ADDR                           ((uint32_t)(0xFFFFUL << MXC_F_EMAC_SA3H_ADDR_POS)) /**< SA3H_ADDR Mask */

/**@} end of group EMAC_SA3H_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_SA4L EMAC_SA4L
 * @brief    Specific Address 4 Bottom.
 * @{
 */
#define MXC_F_EMAC_SA4L_ADDR_POS                       0 /**< SA4L_ADDR Position */
#define MXC_F_EMAC_SA4L_ADDR                           ((uint32_t)(0xFFFFFFFFUL << MXC_F_EMAC_SA4L_ADDR_POS)) /**< SA4L_ADDR Mask */

/**@} end of group EMAC_SA4L_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_SA4H EMAC_SA4H
 * @brief    Specific Address 4 Top.
 * @{
 */
#define MXC_F_EMAC_SA4H_ADDR_POS                       0 /**< SA4H_ADDR Position */
#define MXC_F_EMAC_SA4H_ADDR                           ((uint32_t)(0xFFFFUL << MXC_F_EMAC_SA4H_ADDR_POS)) /**< SA4H_ADDR Mask */

/**@} end of group EMAC_SA4H_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_TID_CK EMAC_TID_CK
 * @brief    Type ID Checking.
 * @{
 */
#define MXC_F_EMAC_TID_CK_TID_POS                      0 /**< TID_CK_TID Position */
#define MXC_F_EMAC_TID_CK_TID                          ((uint32_t)(0xFFFFUL << MXC_F_EMAC_TID_CK_TID_POS)) /**< TID_CK_TID Mask */

/**@} end of group EMAC_TID_CK_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_TPQ EMAC_TPQ
 * @brief    Transmit Pause Quantum.
 * @{
 */
#define MXC_F_EMAC_TPQ_TPQ_POS                         0 /**< TPQ_TPQ Position */
#define MXC_F_EMAC_TPQ_TPQ                             ((uint32_t)(0xFFFFUL << MXC_F_EMAC_TPQ_TPQ_POS)) /**< TPQ_TPQ Mask */

/**@} end of group EMAC_TPQ_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_IO_CTRL EMAC_IO_CTRL
 * @brief    IO Control Register.
 * @{
 */
#define MXC_F_EMAC_IO_CTRL_MODE_POS                    0 /**< IO_CTRL_MODE Position */
#define MXC_F_EMAC_IO_CTRL_MODE                        ((uint32_t)(0x1UL << MXC_F_EMAC_IO_CTRL_MODE_POS)) /**< IO_CTRL_MODE Mask */

/**@} end of group EMAC_IO_CTRL_Register */

/**
 * @ingroup  emac_registers
 * @defgroup EMAC_REV EMAC_REV
 * @brief    Revision register.
 * @{
 */
#define MXC_F_EMAC_REV_REV_POS                         0 /**< REV_REV Position */
#define MXC_F_EMAC_REV_REV                             ((uint32_t)(0xFFFFUL << MXC_F_EMAC_REV_REV_POS)) /**< REV_REV Mask */

#define MXC_F_EMAC_REV_PART_POS                        16 /**< REV_PART Position */
#define MXC_F_EMAC_REV_PART                            ((uint32_t)(0xFFFFUL << MXC_F_EMAC_REV_PART_POS)) /**< REV_PART Mask */

/**@} end of group EMAC_REV_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32570_INCLUDE_EMAC_REGS_H_
